/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   print.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: khelen <khelen@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/09/02 15:08:27 by khelen            #+#    #+#             */
/*   Updated: 2020/09/02 15:33:05 by khelen           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../includes/wolf.h"

/*
** Рисуем картинку на выбранной линии (потоке) 
*/

void	print_wolf(t_wolf *data)
{
	
}

/*
** Распределение линий по потокам, кол-во которых равно высоте окна.
** !!! 02.09 Не проверял работоспособность, ибо забыал как вводить данные
** !!! для рисования. но по идее как-то так. Возмжно роблема может быть в
** !!! передаче аргументов в print_wolf то есть в формате написания последнего
** !!! аргумента pthread_create
*/

void		print_thread_wolf(t_wolf *data)
{
	data->thread_id = 0;
	while (data->thread_id != HEIGHT)
	{
		pthread_create(&data->thread_id, NULL, print_wolf, (void *)data);
    	pthread_join(data->thread_id, NULL);
		data->thread_id++;
	}
}